In [26]:
import pandas as pd
import numpy as np

In [6]:
obj = pd.Series([4,7,-5,3],index = ['d','b','a','c'])

In [7]:
obj.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
obj['d'] = 6
obj[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [15]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Navada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = pd.DataFrame(data,columns = ['year','state','pop','debt'],index = ['one','two','three','four','five'])
frame

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Navada  2.9  NaN

In [22]:
frame.year # frame['year'] (等价)
frame.loc['three'] # frame.iloc[2](等价)

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame['debt'] = np.arange(5.)
frame['eastern'] = frame.state == 'Ohio'
frame
del frame['eastern']
frame

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Navada  2.9   4.0